In [183]:
import pandas as pd

In [184]:
data={ 'apples' : [1,2,3,4,5],
        'bananas': [3,4,5,6,7]}

In [185]:
df = pd.DataFrame(data)

In [186]:
df.index=['Jan','Feb','March','April','May']

In [187]:
df.loc['March',['apples']]

apples    3
Name: March, dtype: int64

In [188]:
df.to_csv('./data/applebanana.csv',)

In [189]:
df2=pd.read_csv('./data/applebanana.csv')

In [190]:
df2.head()

  Unnamed: 0  apples  bananas
0        Jan       1        3
1        Feb       2        4
2      March       3        5
3      April       4        6
4        May       5        7

In [243]:
df2=df2.reset_index().rename(columns={'Unnamed: 0': 'Month'}).set_index('Month')

In [251]:
df2.unstack()

         Month
apples   Jan      1
         Feb      2
         March    3
         April    4
         May      5
bananas  Jan      3
         Feb      4
         March    5
         April    6
         May      7
dtype: int64

In [193]:
df.describe()

         apples   bananas
count  5.000000  5.000000
mean   3.000000  5.000000
std    1.581139  1.581139
min    1.000000  3.000000
25%    2.000000  4.000000
50%    3.000000  5.000000
75%    4.000000  6.000000
max    5.000000  7.000000